import React from 'react';
import PropTypes from 'prop-types';
import {Panel, PanelHeader} from '@vkontakte/vkui';

const Home = ({id, go, fetchedUser}) => (
    <Panel id={id}>
        <PanelHeader>Товары</PanelHeader>
    </Panel>
		{
		"response": {
		"count": 19,
		"items": [{
		"id": 2320917,
		"owner_id": -59405462,
		"title": "Антивирус G Data InternetSecurity (дополнительно к функциям G Data AntiVirus) 5key на 3 ПК",
		"description": "Являемся официальными поставщиками, группа компаний Бегущая Помощь, свой интернет магазин, цены ниже, ключи получаете лицензионные, работаем с юридическими лицами по всей России. Ответить можем прямо на странице поиска в Яндексе.
		5 ключей, каждый на 3 компьютера для ОС Windows
		Являемся официальными поставщиками, группа компаний Бегущая Помощь, свой интернет магазин, цены ниже, ключи получаете лицензионные, работаем с юридическими лицами по всей России. Ответить можем прямо на странице поиска в Яндексе.

		Мгновенная защита при почтовых рассылках: G Data Mail Cloud мгновенно блокирует почтовые эпидемии, благодаря технологии OutbreakShield

		Мгновенная защита Интернет-банкинга: BankGuard защищает от опасных банковских троянов

		Мгновенная защита с помощью контроля поведения: распознает подозрительное поведение неизвестных вирусов

		Оптимальное обнаружение вирусов, благодаря комбинации из двух антивирусных движков

		Минимальная нагрузка на ресурсы за счет технологии «отпечатков файлов» и сканирования во время простоя ПК

		Ежечасное обновление для защиты от новых угроз

		Создание загрузочного DVD для очистки уже зараженной системы

		Защита от взлома: тихий брандмауэр надежно защищает без раздражающих запросов

		Нет спама - раздражающий спам блокируется автоматически

		Родительский контроль блокирует доступ к нежелательным веб-сайтам и контенту

		Демо: https://cloud.mail.ru/public/EWkQ/CWnruRsiw",
		"price": {
		"amount": "660000",
		"currency": {
		"id": 643,
		"name": "RUB"
		},
		"text": "6 600 руб."
		},
		"category": {
		"id": 306,
		"name": "Фильмы, музыка, программы",
		"section": {
		"id": 3,
		"name": "Компьютерная техника"
		}
		},
		"date": 1546199922,
		"thumb_photo": "https://pp.userapi.com/c847121/v847121800/164783/8WPw3iVwKOk.jpg",
		"availability": 0,
		"is_favorite": false
		}, {
		"id": 2320916,
		"owner_id": -59405462,
		"title": "Антивирус G Data InternetSecurity (дополнительно к функциям G Data AntiVirus) 2key на 3 ПК",
		"description": "Являемся официальными поставщиками, группа компаний Бегущая Помощь, свой интернет магазин, цены ниже, ключи получаете лицензионные, работаем с юридическими лицами по всей России. Ответить можем прямо на странице поиска в Яндексе.
		2 ключа, каждый на 3 компьютера для ОС Windows
		Являемся официальными поставщиками, группа компаний Бегущая Помощь, свой интернет магазин, цены ниже, ключи получаете лицензионные, работаем с юридическими лицами по всей России. Ответить можем прямо на странице поиска в Яндексе.

		Мгновенная защита при почтовых рассылках: G Data Mail Cloud мгновенно блокирует почтовые эпидемии, благодаря технологии OutbreakShield

		Мгновенная защита Интернет-банкинга: BankGuard защищает от опасных банковских троянов

		Мгновенная защита с помощью контроля поведения: распознает подозрительное поведение неизвестных вирусов

		Оптимальное обнаружение вирусов, благодаря комбинации из двух антивирусных движков

		Минимальная нагрузка на ресурсы за счет технологии «отпечатков файлов» и сканирования во время простоя ПК

		Ежечасное обновление для защиты от новых угроз

		Создание загрузочного DVD для очистки уже зараженной системы

		Защита от взлома: тихий брандмауэр надежно защищает без раздражающих запросов

		Нет спама - раздражающий спам блокируется автоматически

		Родительский контроль блокирует доступ к нежелательным веб-сайтам и контенту

		Демо: https://cloud.mail.ru/public/EWkQ/CWnruRsiw",
		"price": {
		"amount": "272000",
		"currency": {
		"id": 643,
		"name": "RUB"
		},
		"text": "2 720 руб."
		},
		"category": {
		"id": 306,
		"name": "Фильмы, музыка, программы",
		"section": {
		"id": 3,
		"name": "Компьютерная техника"
		}
		},
		"date": 1546199829,
		"thumb_photo": "https://pp.userapi.com/c848628/v848628800/f181e/owNCp2w9VWc.jpg",
		"availability": 0,
		"is_favorite": false
		}, {
		"id": 2320915,
		"owner_id": -59405462,
		"title": "Антивирус G Data InternetSecurity (дополнительно к функциям G Data AntiVirus) 1key на 3 ПК",
		"description": "Являемся официальными поставщиками, группа компаний Бегущая Помощь, свой интернет магазин, цены ниже, ключи получаете лицензионные, работаем с юридическими лицами по всей России. Ответить можем прямо на странице поиска в Яндексе.
		1 ключ на 3 компьютера для ОС Windows
		Являемся официальными поставщиками, группа компаний Бегущая Помощь, свой интернет магазин, цены ниже, ключи получаете лицензионные, работаем с юридическими лицами по всей России. Ответить можем прямо на странице поиска в Яндексе.

		Мгновенная защита при почтовых рассылках: G Data Mail Cloud мгновенно блокирует почтовые эпидемии, благодаря технологии OutbreakShield

		Мгновенная защита Интернет-банкинга: BankGuard защищает от опасных банковских троянов

		Мгновенная защита с помощью контроля поведения: распознает подозрительное поведение неизвестных вирусов

		Оптимальное обнаружение вирусов, благодаря комбинации из двух антивирусных движков

		Минимальная нагрузка на ресурсы за счет технологии «отпечатков файлов» и сканирования во время простоя ПК

		Ежечасное обновление для защиты от новых угроз

		Создание загрузочного DVD для очистки уже зараженной системы

		Защита от взлома: тихий брандмауэр надежно защищает без раздражающих запросов

		Нет спама - раздражающий спам блокируется автоматически

		Родительский контроль блокирует доступ к нежелательным веб-сайтам и контенту

		Демо: https://cloud.mail.ru/public/EWkQ/CWnruRsiw",
		"price": {
		"amount": "140000",
		"currency": {
		"id": 643,
		"name": "RUB"
		},
		"text": "1 400 руб."
		},
		"category": {
		"id": 306,
		"name": "Фильмы, музыка, программы",
		"section": {
		"id": 3,
		"name": "Компьютерная техника"
		}
		},
		"date": 1546199757,
		"thumb_photo": "https://pp.userapi.com/c849128/v849128800/fd1f2/S3miXmNM7To.jpg",
		"availability": 0,
		"is_favorite": false
		}]
		}
		}
);

Home.propTypes = {
    id: PropTypes.string.isRequired,
    go: PropTypes.func.isRequired,
    fetchedUser: PropTypes.shape({
        photo_200: PropTypes.string,
        first_name: PropTypes.string,
        last_name: PropTypes.string,
        city: PropTypes.shape({
            title: PropTypes.string,
        }),
    }),
};

export default Home;
